In [2]:
#importing libraries
import pandas as pd
import csv
import pymysql
from sqlalchemy import create_engine

In [3]:
#READING DATA FROM BBC TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED BBC

bbc=pd.read_csv("bbc.csv")

#READING DATA FROM WORLD TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED WORLD

world= pd.read_csv(filepath_or_buffer = 'world.csv', delimiter=',', 
                 doublequote=True, quotechar='"',na_values = ['na', '-', '.', ''], 
                 quoting=csv.QUOTE_ALL, encoding = "ISO-8859-1")

#READING DATA FROM ETEAM TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED ETEAM

eteam=pd.read_csv("eteam.csv",delimiter=',', 
                 doublequote=True, quotechar='"',na_values = ['na', '-', '.', ''], 
                 quoting=csv.QUOTE_ALL, encoding = "ISO-8859-1")

#READING DATA FROM GAME TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED GAME

game = pd.read_csv(filepath_or_buffer = 'game.csv')

#READING DATA FROM GOAL TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED GOAL

goal=pd.read_csv('goal.csv',delimiter=',', 
                 doublequote=True, quotechar='"',na_values = ['na', '-', '.', ''], 
                 quoting=csv.QUOTE_ALL, encoding = "ISO-8859-1")

#READING DATA FROM NOBEL TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED NOBEL

nobel=pd.read_csv('nobel.csv')

#READING DATA FROM MOVIES TABLE AND PUTTING THE DATA IN A DATAFRAME NAMED MOVIES

movies=pd.read_csv("movies.csv")

In [4]:
#creating engine to put values in database already created in mysql lab_exercises
engine = create_engine('mysql+pymysql://root:1234@localhost/lab_exercises')

In [5]:
#putting all data in tables
game.to_sql('game', con = engine, if_exists = 'append', chunksize = 1000)
bbc.to_sql('bbc', con = engine, if_exists = 'append', chunksize = 1000)
world.to_sql('world', con = engine, if_exists = 'append', chunksize = 1000)
goal.to_sql('goal', con = engine, if_exists = 'append', chunksize = 1000)
movies.to_sql('movies', con = engine, if_exists = 'append', chunksize = 1000)
nobel.to_sql('nobel', con = engine, if_exists = 'append', chunksize = 1000)
eteam.to_sql('eteam', con = engine, if_exists = 'append', chunksize = 1000)

Question 1. If you know that in the world table, the continent of the countries Armenia, Azerbaijan, Russia, Georgia and Turkey is not Europe. Write a query that returns the total area of the European countries after adding the area of these countries.

In [56]:
world=pd.read_sql_query('SELECT * FROM world',engine)
world.head(1)

,index,name,continent,area,population,gdp,capital,tld,flag
0,0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...

In [87]:
query_1='''
SELECT sum(area)
FROM world 
WHERE name IN ("Armenia", "Azerbaijan", "Russia", "Georgia", "Turkey") or continent='Europe';
'''
pd.read_sql_query(query_1,engine)

    sum(area)
0  80427528.0

Question 2. Write a query that returns the names of the players in the German team who scored at least one goal with the name of the stadium where they scored the goals.

In [ ]:
game=pd.read_sql_query('SELECT * FROM game ', engine)
game.head(1)

In [ ]:
goal=pd.read_sql_query('SELECT * FROM goal',engine)
goal.head(1)

In [25]:
query_2='''
SELECT DISTINCT player,stadium 
FROM Goal 
JOIN game on matchid = id 
WHERE (teamid='GER' AND (team1='GER' OR team2='GER'));
'''
pd.read_sql_query(query_2,engine)

           player                   stadium
0     Mario Gómez                Arena Lviv
1     Mario Gómez          Metalist Stadium
2  Lukas Podolski                Arena Lviv
3     Lars Bender                Arena Lviv
4    Philipp Lahm          PGE Arena Gdansk
5    Sami Khedira          PGE Arena Gdansk
6  Miroslav Klose          PGE Arena Gdansk
7      Marco Reus          PGE Arena Gdansk
8      Mesut Özil  National Stadium, Warsaw

Question 3 Write a query which would show the players and their teams for those who have scored against France (FRA) in Donbass Arena.

In [28]:
query_3='''
SELECT DISTINCT player,teamid,stadium 
FROM Goal 
JOIN game on matchid = id 
WHERE (stadium='Donbass Arena' AND teamid !='FRA' AND (team1='FRA' OR team2='FRA'));
'''
pd.read_sql_query(query_3,engine)

           player teamid        stadium
0  Joleon Lescott    ENG  Donbass Arena
1     Xabi Alonso    ESP  Donbass Arena

question:4 Write a query that displays the name and the the average population of the continent in the world table.

In [29]:

world.head(1)

,index,name,continent,area,population,gdp,capital,tld,flag
0,0,Afghanistan,Asia,652230,25500100,2.036400e+10,Kabul,.af,//upload.wikimedia.org/wikipedia/commons/9/9a/...

In [30]:
query_4='''
SELECT continent,avg(population) 
FROM world 
GROUP BY continent;
'''
pd.read_sql_query(query_4,engine)

       continent  avg(population)
0           Asia     9.240331e+07
1         Europe     1.386959e+07
2         Africa     1.917153e+07
3      Caribbean     3.286291e+06
4  South America     3.135531e+07
5        Eurasia     7.450870e+07
6        Oceania     2.698820e+06
7  North America     4.715956e+07

Question 6. Write a query that lists the countries with no missing values in their gdp. Use the world table.

In [35]:
query_6='''
SELECT DISTINCT name,gdp 
FROM world 
WHERE gdp is NOT NULL;
'''
pd.read_sql_query(query_6,engine)

            name           gdp
0    Afghanistan  2.036400e+10
1        Albania  1.204400e+10
2        Algeria  2.070210e+11
3        Andorra  3.222000e+09
4         Angola  1.163080e+11
..           ...           ...
184    Venezuela  3.824240e+11
185      Vietnam  1.558200e+11
186        Yemen  3.283100e+10
187       Zambia  2.149000e+10
188     Zimbabwe  9.802000e+09

[189 rows x 2 columns]

Ques:8 Write a query to calculate the average budget for movies produced in USA since 2010 (incl. 2010). Use the movies table.

In [36]:
movies=pd.read_sql_query('SELECT * FROM movies',engine)
movies.head(1)

,index,color,director_name,num_critic_for_reviews,duration,director_facebook_likes,actor_3_facebook_likes,actor_2_name,actor_1_facebook_likes,gross,...,num_user_for_reviews,language,country,content_rating,budget,title_year,actor_2_facebook_likes,imdb_score,aspect_ratio,movie_facebook_likes
0,0,Color,James Cameron,723.0,178.0,0.0,855.0,Joel David Moore,1000.0,760505847.0,...,3054.0,English,USA,PG-13,237000000.0,2009.0,936.0,7.9,1.78,33000

In [39]:
query_8='''
SELECT avg(budget) 
FROM movies
WHERE country='USA' AND title_year >=2010;
'''
pd.read_sql_query(query_8,engine)

    avg(budget)
0  5.188213e+07

Ques:9Write a query to count the number of unique directors by names. Use the movies table.

In [44]:
query_9='''
SELECT COUNT(DISTINCT director_name) AS "Number of Directors"
FROM movies;
'''
pd.read_sql_query(query_9,engine)

   Number of Directors
0                 1892

Question 10. Write a query that returns the years in which no Nobel price is given for physics. Use the nobel table.

In [45]:
nobel=pd.read_sql_query('SELECT * FROM nobel',engine)
nobel.head(1)

   index    yr    subject                        winner
0      0  1901  Chemistry  Jacobus Henricus van 't Hoff

In [52]:
query_10='''
SELECT DISTINCT  yr 
FROM nobel
WHERE subject ="Physics";
'''
pd.read_sql_query(query_10,engine)

       yr
0    1901
1    1902
2    1903
3    1904
4    1905
..    ...
105  2012
106  2013
107  2014
108  2015
109  2016

[110 rows x 1 columns]

Question 11. Write a query to count the number of Nobel price winners from Netherlands. Use nobel table.

In [68]:
#no data available for countries
"""
query_11='''
SELECT COUNT winner 
FROM nobel
WHERE country ="Netherlands";
"""

'\nquery_11=\'\'\'\nSELECT COUNT winner \nFROM nobel\nWHERE country ="Netherlands";\n'

Question 12. Write a query to find the number of Nobel price winners of each country. Use nobel table.

In [54]:
#no data available for countries

In [71]:
"""
query_12='''
SELECT country,sum(winner) 
FROM nobel
GROUP BY country ;"""

"\nquery_12='''\nSELECT country,sum(winner) \nFROM nobel\nGROUP BY country ;"

Question 13.Write a query to count the number of Nobel prize winners in Physics. Usenobel table.

In [86]:
query_13='''
SELECT subject, COUNT(DISTINCT(winner))
FROM nobel
WHERE subject='Physics' ;
'''
pd.read_sql_query(query_13,engine)

   subject  COUNT(DISTINCT(winner))
0  Physics                      203

Question 14.Write a query to find the number of Nobel prize winners in each subject. Use nobel table.

In [83]:
query_14='''
SELECT subject,COUNT(DISTINCT(winner))
FROM nobel
GROUP BY subject ;
'''
pd.read_sql_query(query_14,engine)

      subject  COUNT(DISTINCT (winner))
0   Chemistry                       174
1   Economics                        78
2  Literature                       113
3    Medicine                       211
4       Peace                       127
5     Physics                       203